---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointIterator.Reset
source: html/69d0e3b1-0fa5-a3a4-5554-3a26ae0c1c51.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.Reset Method

Resets the iterator to the beginning of the collection.

## Syntax (C#)
```csharp
public virtual void Reset()
```